{
  "source": "omarchy",
  "section": "manual",
  "page": "FAQ #",
  "version": "3.3.3",
  "priority": 1,
  "tags": [
    "omarchy",
    "manual"
  ],
  "content": "Edit your ~/.config/hypr/input.conf file and add this to switch between layouts on Left Alt + Right Alt:\n\n~/.config/hypr/input.conf\n\n# Use multiple keyboard layouts and switch between them with Left Alt + Right Alt\ninput {\n    kb_layout = us,fr\n    kb_options = compose:caps,grp:alts_toggle\n}\n\n# Use multiple keyboard layouts and switch between them with Left Alt + Right Alt\ninput {\n    kb_layout = us,fr\n    kb_options = compose:caps,grp:alts_toggle\n}\n\nYou can even configure Waybar to showing your current keyboard layout in the top bar.\n\nEdit your ~/.config/waybar/config.jsonc file and replace this:\n\n~/.config/waybar/config.jsonc\n\n\"clock\": {\n    \"format\": \"{:%A %H:%M}\",\n\n\"clock\": {\n    \"format\": \"{:%A %H:%M}\",\n\n\"clock\": {\n    \"format\": \"{:%A %I:%M %p}\",\n\n\"clock\": {\n    \"format\": \"{:%A %I:%M %p}\",\n\nThis will display Sunday 10:55 AM.\n\nIf you screenshots to be saved to ~/Pictures/Screenshots instead of just ~/Pictures, you can open Setup > Defaults via the Omarchy menu and set this:\n\n~/Pictures/Screenshots\n\nexport OMARCHY_SCREENSHOT_DIR=\"$HOME/Pictures/Screenshots\"\n\nexport OMARCHY_SCREENSHOT_DIR=\"$HOME/Pictures/Screenshots\"\n\nYou can do the same for screenrecordings using OMARCHY_SCREENRECORD_DIR.\n\nOMARCHY_SCREENRECORD_DIR\n\nJust remember to create the directoy you want to save to and restart Omarchy for this to take effect.\n\nYou'd think that it should all work just plugging in USB C, but unfortunately that isn't the case. The solution I've found to make it work reliably is using the WJESOG DisplayPort + USB-A => USB-C cable. Then speakers and webcam work like a charm.\n\nRemember that you have built-in brightness control in Omarchy for the Apple Displays (both Studio and XDR) using Ctrl + F1 to turn down brightness, Ctrl + F2 to turn it up, and Ctrl + Shift + F2 to set it to max.\n\nIf you don't want programs like Spotify or Obsidian or any of the other preinstalled stuff, you can very easily remove it.\n\nRun Remove > Package to see every package that's installed. Then you can select any package you'd like to remove with tab, and start removing everything you've selected with return.\n\nAnd you can use Remove > Web App from the Omarchy menu to remove any of the preinstalled web apps you don't want.\n\nFor errors and broken bits, see the Troubleshooting section."
}