{
  "source": "omarchy",
  "section": "manual",
  "page": "Monitors #",
  "version": "3.3.3",
  "priority": 1,
  "tags": [
    "omarchy",
    "manual"
  ],
  "content": "Omarchy assumes you're running on a 2x-capable retina-class display by default. This is what you need to get those nice, crisp programmer fonts. It's what laptops like the Framework 13 with it's 2.8K monitor is optimized for. It's what you'd want to run on a 27\" 5K Apple Studio Display/ProArt PA27JCV/Samsung S9/Kuycon G27P or 32\" 6K Apple XDR/ProArt PA32QCV/Kuycon G32P.\n\nSo if you're not running a display with a PPI of 218 or above, you'll want to change the monitor settings. For example, if you have a 27\" or 32\" 4K, you can use fractional scaling by opening ~/.config/hypr/monitors.conf and switching to the recommendation for that combo:\n\n~/.config/hypr/monitors.conf\n\nenv = GDK_SCALE,1.75\nmonitor=,preferred,auto,1.666667\n\nenv = GDK_SCALE,1.75\nmonitor=,preferred,auto,1.666667\n\nIf you're using a 1080p or 1440p display, you'll probably just want to use 1x scaling, so you can use:\n\nenv = GDK_SCALE,1\nmonitor=,preferred,auto,1\n\nenv = GDK_SCALE,1\nmonitor=,preferred,auto,1\n\nChanges to GDK_SCALE apply to applications started after the change. So make sure you quit the windows that you have that are oversized after the change (or close all windows with Ctrl + Alt + Del!).\n\nJust know that it's running Linux on low-resolution displays and using fractional scaling that's given the platform a bad reputation for fussy fonts. It's an entirely self-inflicted situation. With a retina-class display (218ppi+) and 2x scaling, your fonts will look every bit as great on Linux as they would on the Mac (if not better, because no artificial font smoothening above what the font designer intended is applied!).\n\nHyprland works great with multiple screens. Read more about how to lay them out in the Hyprland monitor documentation. You can bind specific workspaces to specific monitors as well.\n\nYou can also checkout Hyprmon, if you'd like a TUI to help you with the positioning of multiple screens."
}