{
  "source": "omarchy",
  "section": "manual",
  "page": "Mac support #",
  "version": "3.3.3",
  "priority": 1,
  "tags": [
    "omarchy",
    "manual"
  ],
  "content": "As of Omarchy 3, there's built-in support for Intel Macs. There are a couple of known limitations at the moment, but as long as you're aware and OK with those; you can breathe some new life into your old Macs by loading Omarchy.\n\nPlease note that installing on an M-series Mac is not directly supported at this time. You can find out more about the state of this in #omarchy-on-other in our Discord.\n\nIn a simple test, we were able to achieve 36% performance gains on a 2019 MacBook Pro just by installing Omarchy.\n\nOmarchy only supports being the only OS installed at the moment. During the installation, the drive will be wiped and MacOS will no longer be bootable.\n\nYou can still restore it later via Internet Recovery if you'd like.\n\nFor the sake of this part, we'll assume you've already reviewed Getting Started and have your USB drive ready. If you don't go ahead and do that now.\n\nIt is necessary to disable Apple's Secure Boot in order to boot the bootable USB, as well as the OS. To disable it, perform the following:\n\nTurn it on and immediately press and hold Command-R until you see the loading screen appear\n\nSelect your user and enter your password if prompted\n\nOnce in the recovery screen, choose Utilities > Startup Security Utility from the menubar\n\nEnter your password when prompted to authenticate\n\nChoose \"No Security\" from the Secure Boot options\n\nChoose \"Allow booting from external or removable media\" from the External Boot options\n\nRestart your Mac and immediately press and hold Option until you see a screen of boot devices\n\nSelect the orange EFI Boot device\n\nProceed with the install as normal\n\nMembers of the community are constantly working on solutions to these challenges so if these are problematic for you, join #omarchy-on-other in our Discord and see if there's any up-to-date methods for resolving these.\n\nThe Apple T1 chip was introduced in late 2016 and used exclusively in the first-generation MacBook Pro models with Touch Bar.\n\nMacBook Pro 13-inch (2016, two Thunderbolt 3 ports) – Model: A1706\n\nMacBook Pro 13-inch (2016, four Thunderbolt 3 ports) – Model: A1708\n\nMacBook Pro 15-inch (2016) – Model: A1707\n\nTouch Bar is non-functional\n\nSound is not functioning\n\nThe Apple T2 Security Chip was introduced in 2017. The T2 chip was discontinued with the transition to Apple silicon (M-series chips) starting in 2020.\n\niMac Pro (2017) – Model: A1862\n\nMacBook Pro 13-inch (2018, four Thunderbolt 3 ports) – Model: A1989\n\nMacBook Pro 15-inch (2018) – Model: A1990\n\nMacBook Air (Retina, 13-inch, 2018) – Model: A1932\n\nMac mini (2018) – Model: A1998\n\nMacBook Pro 13-inch (2019, two Thunderbolt 3 ports) – Model: A2159\n\nMacBook Pro 13-inch (2019, four Thunderbolt 3 ports) – Model: A2178\n\nMacBook Pro 15-inch (2019) – Model: A1990\n\nMacBook Pro 13-inch (2020, two Thunderbolt 3 ports) – Model: A2265\n\nMacBook Pro 15-inch (2020) – Model: A1990"
}