{
  "source": "omarchy",
  "section": "manual",
  "page": "Navigation #",
  "version": "3.3.1",
  "priority": 1,
  "tags": [
    "omarchy",
    "manual"
  ],
  "content": "Everything in Omarchy happens via the keyboard — EVERYTHING! When the system first starts, you literally can't do a thing with the mouse alone. But you can hit Super + Space to reveal the application launcher and Super + Alt + Space to open the Omarchy Menu. These two commands allow you to do just about everything.\n\nBut the application launcher is not intended to be the main way to operate the system most of the time. We can get faster than that! All the most important applications are bound directly to individual hotkeys. You start the terminal with Super + Return and a browser with Super + Shift + B. Try doing one after the other, and you'll see the magic of Hyprland's tiling in action:\n\nYou can then hit Super + J to stack them horizontally instead of vertically:\n\nHit Super + J again to return them to horizontal positions. Then try Super + Shift + Arrow Right while on the browser to swap the windows.\n\nSuper + Shift + Arrow Right\n\nNow try Super + Shift + T to start the Activity monitor and then Super + Shift + F to open the files manager. You'll have a neat four-way setup:\n\nYou navigate between the window you want to be active with Super + Arrow. This will switch focus and move the cursor to the center of the new application.\n\nIf you hit Super + Shift + 2, you'll move the current focused application onto the second workspace. Super + Shift + 1 moves it back. (And Super + Shift + Alt + 2 will move the current focused application onto the second workspace without switching to it).\n\nSuper + Shift + Alt + 2\n\nIf you hold down Super and use the mouse to click on a window, you'll be able to rearrange where it sits. If you hold Super and use the right button on the mouse, you can freely resize the window.\n\nYou close a window on Super + W and you can turn a window free-floating with Super + T (and again to return it to a tile).\n\nYou can also go full screen with Super + F or even just full-width (keeping the top bar) with Super + Alt + F.\n\nWindows can be grouped using Super + G. Once you're in a group, every window you start while that's active will belong to the group. You can move between these grouped windows using Super + Ctrl + Arrows or Super + Alt + 1/2/3/4 to go directly to grouped window in order. You can move a window out of the grouping with Super + Alt + G or disassemble the entire group by hitting Super + G again. Finally, you can move windows outside the group into it with Super + Alt + Arrows.\n\nSuper + Ctrl + Arrows\n\nSuper + Alt + 1/2/3/4\n\nFinally, there's a special scratchpad workspace that overlays on whatever workspace you're currently on. You access what's on that using Super + S and you place windows there using Super + Alt + S. It works well for controls or perhaps a terminal that you quickly want to interact with in an overlay without leaving the current workspace. If you want to move a window off the scratchpad, you just move it directly to another workspace with something like Super + Shift + 1 to move it to workspace 1.\n\nIt takes a little while to get used to navigating your desktop like this, but once you do, it'll be hard to go back to a traditional mouse-driven desktop experience!"
}