{
  "source": "omarchy",
  "section": "manual",
  "page": "Web Apps #",
  "version": "3.2.3",
  "priority": 1,
  "tags": [
    "omarchy",
    "manual"
  ],
  "content": "You can add your own web apps using Install > Web App in the Omarchy menu (Super + Alt + Space). It'll ask you for the app name, app URL, and then the icon URL. You can get great PNG icons for many popular web apps on Dashboard Icons.\n\nThey'll then be accessible through the app launcher (Super + Space), and use the beautiful frameless web-app window.\n\nIf you wish to remove a web app, just go to Remove > Web App in the Omarchy menu.\n\nIt's best if you log into all your accounts using a regular browser before using the web app shortcuts. The thin wrapper frame doesn't work well with 1password, so just easier to be logged in directly first.\n\nAll the keyboard hotkeys for these web apps can be changed in ~/.config/hypr/bindings.conf.\n\n~/.config/hypr/bindings.conf\n\nWhen you're in a web app, you can copy the current URL to the clipboard using Shift + Alt + L.\n\nBy default, Omarchy already ships with an assortment of default apps:\n\nHEY is an email and calendar service that serves as a great alternative to people tired of Gmail, Outlook, or Apple Mail. It's made by 37signals where Omarchy originated.\n\nYou can start HEY Email using Super + Shift + E and HEY Calendar using Super + Shift + C.\n\nBasecamp is a project management service that helps small teams move faster and make more progress. Instead of patching together a mishmash of Trello, Slack, Asana, Notion, or whatever, you can have it all in one place with Basecamp. It's made by 37signals where Omarchy originated.\n\nYou can start Basecamp using the application launcher (Super + Space)\n\nChatGPT is the most popular AI chat bot in the world.\n\nYou can start ChatGPT using Super + Shift + A.\n\nWhatsApp is one of the most popular messaging services in the world, and the web version is a great option for Linux.\n\nYou can start WhatsApp using Super + Ctrl + G.\n\nX is where news break.\n\nYou can start X using Super + Shift + X and go straight to writing a new post with Super + Shift + Alt + X.\n\nSuper + Shift + Alt + X\n\nYouTube is the most video platform in the world.\n\nYou can start YouTube using Super + Shift + Y.\n\nZoom is the most popular video chat system used in the US. Great connections across the world. And 40-minute meetings can be held without a paying account.\n\nYou start Zoom using the application launcher (Super + Space)."
}