{
  "source": "omarchy",
  "section": "manual",
  "page": "Dotfiles #",
  "version": "3.2.3",
  "priority": 1,
  "tags": [
    "omarchy",
    "manual"
  ],
  "content": "Omarchy is primarily configured through the so-called dotfiles that live in ~/.config. Those are considered your files for your changes. The files that live in ~/.local/share/omarchy belong to Omarchy itself, and you ideally shouldn't be messing with those. If you need to change anything in ~/.local/share/omarchy, you should be overwriting the value in ~/.config instead.\n\n~/.local/share/omarchy\n\n~/.local/share/omarchy\n\nAlmost everything can be edited through Setup > Configs > [process] through the Omarchy menu (Super + Alt + Space). When you do it this way, any process that needs restarting after config edits automatically will be after you quit the Neovim editor (:wq, remember!).\n\nHere's a list of the key files in ~/.config and what they control:\n\n~/.config/hypr/hyprland.conf\n\n~/.config/hypr/monitors.conf\n\n~/.config/hypr/hypridle.conf\n\n~/.config/hypr/hyprlock.conf\n\n~/.config/waybar/config.jsonc\n\n~/.config/waybar/style.css\n\n~/.config/walker/config.toml\n\n~/.config/ghostty/config\n\n~/.config/uwsm/default\n\nomarchy-restart-xcompose\n\nIf you end up making a lot of changes to tweak your own setup, it's a good idea to backup all these dotfiles. Stow is a great way to do that.\n\nOmarchy ships with a bunch of ergonomic aliases and helpful functions, but it's very common to want to add your own. You should add both aliases, functions, and exports in ~/.bashrc. This file will not be overwritten on updates. If you want to change any of the Omarchy defaults, you can also safely add them here.\n\nLook, this is your computer. You can do whatever you want with it, but I would advise against making changes to the files in ~/.local/share/omarchy directly. It'll make it harder for you to upgrade in the future. You're better off just overwriting any default values you don't like in the ~/.config/* folder instead.\n\n~/.local/share/omarchy\n\nYou can change just about everything that way, like the default keybindings. Just edit ~/.config/hypr/hyprland.conf to, say, replace Obsidian with Joplin (install with yay -S joplin-bin):\n\n~/.config/hypr/hyprland.conf\n\nbind = SUPER SHIFT, O, exec, joplin\n\nbind = SUPER SHIFT, O, exec, joplin\n\nIf you insist on changing internal Omarchy files, you'll need to commit your changes before you can use omarchy-update. You can do that with gcam \"Look ma! I'm breaking the rules!\" from inside the ~/.local/share/omarchy directory. Ain't nobody here to tell you what to do!\n\ngcam \"Look ma! I'm breaking the rules!\"\n\n~/.local/share/omarchy"
}